# Everledger Code Test

Author: Ninad G. Wadekar   
Date: 01/12/2021

In [1]:
# Need xlrd library for reading data and formatting information from 
# Excel files in the historical .xls format.

!pip install xlrd

Requirement already satisfied: xlrd in c:\users\61431\anaconda3\envs\ninad_haai\lib\site-packages (2.0.1)

In [2]:
# Import necessary libraries

import pandas as pd

# Parse the attached employee__1_.xls file

In [3]:
# Reading employee__1_.xls file and converting it to dataframe

df_employee = pd.read_excel('employee__1_.xls')
print(df_employee)

    Emp ID First Name Last Name Gender     Father's Name       Mother's Name  \
0   677509       Lois    Walker      F     Donald Walker        Helen Walker
1   940761     Brenda  Robinson      F  Raymond Robinson       Judy Robinson
2   428945        Joe  Robinson      M    Scott Robinson  Stephanie Robinson
3   408351      Diane     Evans      F       Jason Evans      Michelle Evans
4   193819   Benjamin   Russell      M   Gregory Russell   Elizabeth Russell
..     ...        ...       ...    ...               ...                 ...
95  639892       Jose      Hill      M       Carlos Hill           Anna Hill
96  704709     Harold    Nelson      M    Richard Nelson       Pamela Nelson
97  461593     Nicole      Ward      F        Ralph Ward          Julia Ward
98  392491    Theresa    Murphy      F     George Murphy   Jacqueline Murphy
99  495141      Tammy     Young      F      Andrew Young        Brenda Young

   Mother's Maiden Name        Date of Birth      Date of Joining  \
0                 Lewis            3/29/1981           11/24/2003
1                 Perry            7/31/1970            7/27/2008
2                Taylor            6/16/1963  2016-03-08 00:00:00
3                 Allen  1977-04-12 00:00:00            4/16/1999
4                Nelson            4/17/1977            7/25/2013
..                  ...                  ...                  ...
95                Hayes  1994-08-10 00:00:00  2016-09-07 00:00:00
96                Smith           12/24/1984            8/23/2011
97                  Lee  1964-12-12 00:00:00            1/23/1989
98             Peterson           12/30/1987  2010-03-08 00:00:00
99             Robinson            3/22/1979            4/25/2015

   Quarter of Joining    Place Name              County          City State  \
0                  Q4        Denver              Denver        Denver    CO
1                  Q3     Stonewall             De Soto     Stonewall    LA
2                  Q3  Michigantown             Clinton  Michigantown    IN
3                  Q2      Hydetown            Crawford      Hydetown    PA
4                  Q3       Fremont             Waupaca       Fremont    WI
..                ...           ...                 ...           ...   ...
95                 Q3        Biloxi            Harrison        Biloxi    MS
96                 Q3  Carol Stream        Carol Stream  Carol Stream    IL
97                 Q1       Detroit               Wayne       Detroit    MI
98                 Q3      Mc Grath  Yukon-Koyukuk (CA)      Mc Grath    AK
99                 Q2          Alma             Gratiot          Alma    MI

      Zip   User Name
0   80224    lhwalker
1   71078  bsrobinson
2   46057  jwrobinson
3   16328     dievans
4   54940   brrussell
..    ...         ...
95  39532      jkhill
96  60351    hznelson
97  48278      noward
98  99627    trmurphy
99  48801     tbyoung

[100 rows x 16 columns]

# Normalize the date fields into a standard format

In [14]:
# Let's first check shape of dataframe, data type of each column in the
# dataframe and if there is null values in the dataframe

print('1. Shape of dataframe: ', df_employee.shape)

print('\n2. Datatype of each column in the dataframe:\n',\
      df_employee.dtypes)

print('\n3 .Number of null values in each column:\n',\
      df_employee.isna().sum())

1. Shape of dataframe:  (100, 17)

2. Datatype of each column in the dataframe:
 Emp ID                           int64
First Name                      object
Last Name                       object
Gender                          object
Father's Name                   object
Mother's Name                   object
Mother's Maiden Name            object
Date of Birth           datetime64[ns]
Date of Joining         datetime64[ns]
Quarter of Joining              object
Place Name                      object
County                          object
City                            object
State                           object
Zip                              int64
User Name                       object
Full Name                       object
dtype: object

3 .Number of null values in each column:
 Emp ID                  0
First Name              0
Last Name               0
Gender                  0
Father's Name           0
Mother's Name           0
Mother's Maiden Name    0
Date of Birth           0
Date of Joining         0
Quarter of Joining      0
Place Name              0
County                  0
City                    0
State                   0
Zip                     0
User Name               0
Full Name               0
dtype: int64

In [5]:
# We can see from above column datatype description that Date of Birth and
# Date of Joining are object datatypes. Let's normalize these columns to 
# standard date format YYYY-MM-DD.

# Normalizing Date of Birth column
df_employee['Date of Birth'] = pd.to_datetime(df_employee['Date of Birth'],\
                                              errors='coerce')

# Normalizing Date of Joining column
df_employee['Date of Joining'] = pd.to_datetime(df_employee['Date of Joining'],\
                                              errors='coerce')

print('Date of Birth and Date of Joining datatype changed:\n', df_employee.dtypes)

print('\n\ndf_employee with normalized date column \n\n', df_employee)

Date of Birth and Date of Joining datatype changed:
 Emp ID                           int64
First Name                      object
Last Name                       object
Gender                          object
Father's Name                   object
Mother's Name                   object
Mother's Maiden Name            object
Date of Birth           datetime64[ns]
Date of Joining         datetime64[ns]
Quarter of Joining              object
Place Name                      object
County                          object
City                            object
State                           object
Zip                              int64
User Name                       object
dtype: object


df_employee with normalized date column

     Emp ID First Name Last Name Gender     Father's Name       Mother's Name  \
0   677509       Lois    Walker      F     Donald Walker        Helen Walker
1   940761     Brenda  Robinson      F  Raymond Robinson       Judy Robinson
2   428945        Joe  Robinson      M    Scott Robinson  Stephanie Robinson
3   408351      Diane     Evans      F       Jason Evans      Michelle Evans
4   193819   Benjamin   Russell      M   Gregory Russell   Elizabeth Russell
..     ...        ...       ...    ...               ...                 ...
95  639892       Jose      Hill      M       Carlos Hill           Anna Hill
96  704709     Harold    Nelson      M    Richard Nelson       Pamela Nelson
97  461593     Nicole      Ward      F        Ralph Ward          Julia Ward
98  392491    Theresa    Murphy      F     George Murphy   Jacqueline Murphy
99  495141      Tammy     Young      F      Andrew Young        Brenda Young

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
0                 Lewis    1981-03-29      2003-11-24                 Q4
1                 Perry    1970-07-31      2008-07-27                 Q3
2                Taylor    1963-06-16      2016-03-08                 Q3
3                 Allen    1977-04-12      1999-04-16                 Q2
4                Nelson    1977-04-17      2013-07-25                 Q3
..                  ...           ...             ...                ...
95                Hayes    1994-08-10      2016-09-07                 Q3
96                Smith    1984-12-24      2011-08-23                 Q3
97                  Lee    1964-12-12      1989-01-23                 Q1
98             Peterson    1987-12-30      2010-03-08                 Q3
99             Robinson    1979-03-22      2015-04-25                 Q2

      Place Name              County          City State    Zip   User Name
0         Denver              Denver        Denver    CO  80224    lhwalker
1      Stonewall             De Soto     Stonewall    LA  71078  bsrobinson
2   Michigantown             Clinton  Michigantown    IN  46057  jwrobinson
3       Hydetown            Crawford      Hydetown    PA  16328     dievans
4        Fremont             Waupaca       Fremont    WI  54940   brrussell
..           ...                 ...           ...   ...    ...         ...
95        Biloxi            Harrison        Biloxi    MS  39532      jkhill
96  Carol Stream        Carol Stream  Carol Stream    IL  60351    hznelson
97       Detroit               Wayne       Detroit    MI  48278      noward
98      Mc Grath  Yukon-Koyukuk (CA)      Mc Grath    AK  99627    trmurphy
99          Alma             Gratiot          Alma    MI  48801     tbyoung

[100 rows x 16 columns]

# Group the employee list based on the field "Quarter of Joining" and sorted by the field "Date of Birth" and print as dictionary {Q1 : [emp1, emp2, ...]}

In [6]:
# Since we need to groupby 'Quarter of Joining', let's first check unique values
# of this column. This will also make us aware if there are any incorrect values.

print('Unique values in Quarter of Joining column:\n',\
      df_employee['Quarter of Joining'].unique())

# Thus values in Quarter of Joining column are consistent and correct.

Unique values in Quarter of Joining column:
 ['Q4' 'Q3' 'Q2' 'Q1']

In [7]:
# Since we need to display employee name, let's check if there are
# more than one employees with same First Name.

print('Results show if First Name is same for multiple employees: \n',\
      df_employee['First Name'].value_counts())

# We can see from below results that some employees have same first
# names. To improve probability of uniquely identifing employee 
# belonging to particular Quarter in final results, we can merge  
# First Name and Last Name to create new column called Full Name.

df_employee['Full Name'] = df_employee[['First Name', 'Last Name']]\
                            .apply(lambda x: ' '.join(x), axis=1)

print('\n Dataframe with new column Full Name:\n',df_employee)

Results show if First Name is smae for multiple employees:
 Nancy       4
Carol       2
Margaret    2
Anne        2
Brenda      2
           ..
Jose        1
Jeremy      1
Ralph       1
Julia       1
Dorothy     1
Name: First Name, Length: 79, dtype: int64

 Dataframe with new column Full Name:
     Emp ID First Name Last Name Gender     Father's Name       Mother's Name  \
0   677509       Lois    Walker      F     Donald Walker        Helen Walker
1   940761     Brenda  Robinson      F  Raymond Robinson       Judy Robinson
2   428945        Joe  Robinson      M    Scott Robinson  Stephanie Robinson
3   408351      Diane     Evans      F       Jason Evans      Michelle Evans
4   193819   Benjamin   Russell      M   Gregory Russell   Elizabeth Russell
..     ...        ...       ...    ...               ...                 ...
95  639892       Jose      Hill      M       Carlos Hill           Anna Hill
96  704709     Harold    Nelson      M    Richard Nelson       Pamela Nelson
97  461593     Nicole      Ward      F        Ralph Ward          Julia Ward
98  392491    Theresa    Murphy      F     George Murphy   Jacqueline Murphy
99  495141      Tammy     Young      F      Andrew Young        Brenda Young

   Mother's Maiden Name Date of Birth Date of Joining Quarter of Joining  \
0                 Lewis    1981-03-29      2003-11-24                 Q4
1                 Perry    1970-07-31      2008-07-27                 Q3
2                Taylor    1963-06-16      2016-03-08                 Q3
3                 Allen    1977-04-12      1999-04-16                 Q2
4                Nelson    1977-04-17      2013-07-25                 Q3
..                  ...           ...             ...                ...
95                Hayes    1994-08-10      2016-09-07                 Q3
96                Smith    1984-12-24      2011-08-23                 Q3
97                  Lee    1964-12-12      1989-01-23                 Q1
98             Peterson    1987-12-30      2010-03-08                 Q3
99             Robinson    1979-03-22      2015-04-25                 Q2

      Place Name              County          City State    Zip   User Name  \
0         Denver              Denver        Denver    CO  80224    lhwalker
1      Stonewall             De Soto     Stonewall    LA  71078  bsrobinson
2   Michigantown             Clinton  Michigantown    IN  46057  jwrobinson
3       Hydetown            Crawford      Hydetown    PA  16328     dievans
4        Fremont             Waupaca       Fremont    WI  54940   brrussell
..           ...                 ...           ...   ...    ...         ...
95        Biloxi            Harrison        Biloxi    MS  39532      jkhill
96  Carol Stream        Carol Stream  Carol Stream    IL  60351    hznelson
97       Detroit               Wayne       Detroit    MI  48278      noward
98      Mc Grath  Yukon-Koyukuk (CA)      Mc Grath    AK  99627    trmurphy
99          Alma             Gratiot          Alma    MI  48801     tbyoung

           Full Name
0        Lois Walker
1    Brenda Robinson
2       Joe Robinson
3        Diane Evans
4   Benjamin Russell
..               ...
95         Jose Hill
96     Harold Nelson
97       Nicole Ward
98    Theresa Murphy
99       Tammy Young

[100 rows x 17 columns]

In [8]:
# Ref: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html
# Groupby preserves the order of rows of original dataframe within each group. 
# Thus we can sort first based on Date of Birth and then groupby Quarter of Joining 
# and subsequently converting results into dictionary

grouped_sorted_emp_dict = df_employee.sort_values(['Date of Birth'], ascending=False)\
                            .groupby('Quarter of Joining')['Full Name']\
                            .apply(list)\
                            .to_dict()

print(grouped_sorted_emp_dict)

{'Q1': ['Jack Alexander', 'Melissa Butler', 'Matthew Turner', 'Ann Cooper', 'Theresa Lee', 'Sharon Lopez', 'Martha Washington', 'Daniel Cooper', 'Ernest Martinez', 'Larry Miller', 'Diana Peterson', 'Steven Phillips', 'Ernest Washington', 'Cynthia Ramirez', 'Phillip White', 'Deborah Smith', 'Debra Wood', 'Roger Roberts', 'William Hernandez', 'Nicole Ward', 'Elizabeth Jackson', 'Cynthia White', 'Nancy Howard', 'Julia Scott', 'Judy Gonzales', 'Carol Murphy'], 'Q2': ['Pamela Wright', 'Antonio Roberts', 'Carol Edwards', 'Todd Hall', 'Linda Moore', 'Andrea Garcia', 'Henry Jenkins', 'Amanda Hughes', 'Lillian Brown', 'Margaret Allen', 'Amy Howard', 'Tammy Young', 'Alan Rivera', 'Diane Evans', 'Ralph Flores', 'Carl Collins', 'Thomas Lewis', 'Jeremy Sanchez', 'Mary Bryant', 'Rebecca Stewart', 'Joyce Jenkins', 'Frances Young', 'Paul Watson'], 'Q3': ['Wayne Watson', 'Nancy Baker', 'Jose Hill', 'Gregory Edwards', 'Richard Mitchell', 'Ryan Alexander', 'Margaret Brooks', 'Paul Cooper', 'Roy Griffin', 'Theresa Murphy', 'Douglas Flores', 'Cheryl Miller', 'Jack Campbell', 'Harold Nelson', 'Nancy Davis', 'Donna Brown', 'Patrick Bailey', 'Janice Parker', 'Ruby Rogers', 'Benjamin Russell', 'Kelly Adams', 'Jason Anderson', 'Brenda Robinson', 'Joshua Stewart', 'Aaron Price', 'Ruby Stewart', 'Paula Diaz', 'Joe Robinson', 'Brenda Butler', 'Frances Watson', 'Carolyn Hayes', 'Anne Perez'], 'Q4': ['Nancy Jones', 'Ann Coleman', 'Anne Russell', 'Dorothy Edwards', 'Peter Washington', 'Lois Walker', 'Janet Henderson', 'Eugene Perez', 'Carolyn Price', 'Maria Walker', 'Lillian Mitchell', 'Joan Stewart', 'Melissa King', 'Mary Wilson', 'Jimmy Howard', 'Judy Hernandez', 'Clarence Ross', 'Christopher Nelson', 'Cheryl Scott']}

In [9]:
# Let's verify if above results are correct by comparing list of Q1 with
# list obtained by alternate method. 

# For verification, df_employee is filtered on rows with Quarter of Joining
# as Q1 and sliced to keep only First Name and Date of Birth columns. Further
# sliced dataframe is sorted in descending order of Date of Birth. This is
# alternate method which results into same sorted list of employees as above 
# based on Date of Birth and belonging to selected Quarter of Joining. 

verification_df = df_employee[df_employee['Quarter of Joining'] == 'Q1']\
                    [['Full Name', 'Date of Birth']]\
                    .sort_values('Date of Birth', ascending=False)

name_list_for_verification = list(verification_df['Full Name'])

In [10]:
# Let's check if list of Q1 in grouped_sorted_emp_dict is same as 
# name_list_for_verification

if name_list_for_verification == grouped_sorted_emp_dict['Q1']:
    print('Lists are same.')
else:
    print('List are different.')

Lists are same.

In [11]:
# Displaying dictionary in more readable format

for k, v in grouped_sorted_emp_dict.items():
    print(k, ':', v, '\n')

Q1 : ['Jack Alexander', 'Melissa Butler', 'Matthew Turner', 'Ann Cooper', 'Theresa Lee', 'Sharon Lopez', 'Martha Washington', 'Daniel Cooper', 'Ernest Martinez', 'Larry Miller', 'Diana Peterson', 'Steven Phillips', 'Ernest Washington', 'Cynthia Ramirez', 'Phillip White', 'Deborah Smith', 'Debra Wood', 'Roger Roberts', 'William Hernandez', 'Nicole Ward', 'Elizabeth Jackson', 'Cynthia White', 'Nancy Howard', 'Julia Scott', 'Judy Gonzales', 'Carol Murphy']

Q2 : ['Pamela Wright', 'Antonio Roberts', 'Carol Edwards', 'Todd Hall', 'Linda Moore', 'Andrea Garcia', 'Henry Jenkins', 'Amanda Hughes', 'Lillian Brown', 'Margaret Allen', 'Amy Howard', 'Tammy Young', 'Alan Rivera', 'Diane Evans', 'Ralph Flores', 'Carl Collins', 'Thomas Lewis', 'Jeremy Sanchez', 'Mary Bryant', 'Rebecca Stewart', 'Joyce Jenkins', 'Frances Young', 'Paul Watson']

Q3 : ['Wayne Watson', 'Nancy Baker', 'Jose Hill', 'Gregory Edwards', 'Richard Mitchell', 'Ryan Alexander', 'Margaret Brooks', 'Paul Cooper', 'Roy Griffin', 'Theresa Murphy', 'Douglas Flores', 'Cheryl Miller', 'Jack Campbell', 'Harold Nelson', 'Nancy Davis', 'Donna Brown', 'Patrick Bailey', 'Janice Parker', 'Ruby Rogers', 'Benjamin Russell', 'Kelly Adams', 'Jason Anderson', 'Brenda Robinson', 'Joshua Stewart', 'Aaron Price', 'Ruby Stewart', 'Paula Diaz', 'Joe Robinson', 'Brenda Butler', 'Frances Watson', 'Carolyn Hayes', 'Anne Perez']

Q4 : ['Nancy Jones', 'Ann Coleman', 'Anne Russell', 'Dorothy Edwards', 'Peter Washington', 'Lois Walker', 'Janet Henderson', 'Eugene Perez', 'Carolyn Price', 'Maria Walker', 'Lillian Mitchell', 'Joan Stewart', 'Melissa King', 'Mary Wilson', 'Jimmy Howard', 'Judy Hernandez', 'Clarence Ross', 'Christopher Nelson', 'Cheryl Scott']